## PANDAS HANDS-ON 1

1. Given a sample list, tuple and a set with elements as numbers from 1-10. Convert each
of the data types into a pandas series. Create a separate list of index values for the
series.

In [1]:
import pandas as pd

In [17]:
list1=[2,1,3,4,5,6,7,8,9,10]
tuple1=(1,2,3,4,5,6,7,8,9,10)
set1={1,2,3,4,5,6,7,8,9,10}

In [18]:
set1

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [19]:
series1=pd.Series(list1,index=['a','b','c','d','e','f','g','h','i','j'])
series2=pd.Series(tuple1,index=['A','B','C','D','E','F','G','H','I','J'])

In [20]:
series1

a     2
b     1
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [6]:
series2

A     1
B     2
C     3
D     4
E     5
F     6
G     7
H     8
I     9
J    10
dtype: int64

In [7]:
series3=pd.Series(set1)

TypeError: 'set' type is unordered

In [9]:
series3=pd.Series(list(set1))
series3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [16]:
series3 = pd.Series(sorted(set1), index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
series3

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [22]:
type(sorted(set1))

list

2. Create a python dictionary with three key value pairs. Keep the keys as the first names,
and the respective last names as values in the dictionary. Use the dictionary to create a
pandas series.

In [23]:
dict1={'Shiv':'Sharma','Shreya':'Jain','Ankit':'Raj'}
dict1

{'Shiv': 'Sharma', 'Shreya': 'Jain', 'Ankit': 'Raj'}

In [24]:
series4=pd.Series(dict1)

In [25]:
series4

Shiv      Sharma
Shreya      Jain
Ankit        Raj
dtype: object

3. Create a pandas series, with the elements as numbers from 1-10. Use the index values
starting from 0-10. For the above series:

a. Convert it to a list.

b. Convert it to a dictionary.

c. Convert it to a tuple.

d. Convert it to a set.

In [26]:
series5=pd.Series(range(1,11))

In [27]:
series5

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [28]:
l1=list(series5)
l1

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [29]:
t1=tuple(series5)
t1

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [31]:
d1=dict(series5)
d1

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

In [32]:
s1=set(series5)
s1

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

4. Create a sample pandas series with x integer elements. Perform the following operations
on the same:


a. Print the first 5 elements of the series

b. Print the last 5 elements of the series

c. Insert an integer value ‘50’ at the index 5.

d. Update the last element in the series with the value 100.

e. Delete the first element from the series.

Note: The index values must not be affected by the operations and should be uniform for
the series after the last operation.

In [79]:
series6=pd.Series([10,20,30,40,55,60,70,80,90,99])
series6

0    10
1    20
2    30
3    40
4    55
5    60
6    70
7    80
8    90
9    99
dtype: int64

In [80]:
series6[0:5]

0    10
1    20
2    30
3    40
4    55
dtype: int64

In [81]:
series6.head()

0    10
1    20
2    30
3    40
4    55
dtype: int64

In [82]:
series6[-5:]

5    60
6    70
7    80
8    90
9    99
dtype: int64

In [83]:
series6.tail()

5    60
6    70
7    80
8    90
9    99
dtype: int64

In [47]:
#series6[5]=50

In [84]:
series6

0    10
1    20
2    30
3    40
4    55
5    60
6    70
7    80
8    90
9    99
dtype: int64

In [97]:
l2=list(series6)

In [98]:
l2.insert(5,50)

In [99]:
series7=pd.Series(l2)
series7

0      10
1      20
2      30
3      40
4      55
5      50
6      60
7      70
8      80
9      90
10    100
dtype: int64

In [58]:
l2=list(series6(insert(5,50)))

NameError: name 'insert' is not defined

In [63]:
series6

0     10
1     20
2     30
3     40
4     55
5     60
6     70
7     80
8     90
9    100
dtype: int64

In [64]:
s3=pd.Series(list(series6).insert(5,50),dtype=int)

In [65]:
s3

Series([], dtype: int32)

In [75]:
print(list(series6).insert(5,50))

None

In [70]:
series6

0     10
1     20
2     30
3     40
4     55
5     60
6     70
7     80
8     90
9    100
dtype: int64

In [73]:
index=5
element=50
series=series6.insert(index.element)

AttributeError: 'Series' object has no attribute 'insert'

In [74]:
pd.insert(series6,5,50)

AttributeError: module 'pandas' has no attribute 'insert'

In [76]:
a=[1,2,3,4]

b=pd.Series(a)

In [77]:
type(list(b).insert(2,10))

NoneType

In [93]:
series6

0    10
1    20
2    30
3    40
4    55
5    60
6    70
7    80
8    90
9    99
dtype: int64

In [92]:
series6[-1:]

9    99
dtype: int64

In [95]:
series6.iloc[-1]=100

In [96]:
series6

0     10
1     20
2     30
3     40
4     55
5     60
6     70
7     80
8     90
9    100
dtype: int64

In [101]:
series8=series6.drop(0)

In [104]:
series8.reset_index(drop=True)

0     20
1     30
2     40
3     55
4     60
5     70
6     80
7     90
8    100
dtype: int64

5. For a given pandas series obtained in the 4th step. Write a sample code to find the
element 100 in the series.

In [105]:
series6

0     10
1     20
2     30
3     40
4     55
5     60
6     70
7     80
8     90
9    100
dtype: int64

In [107]:
series6[6]=100

In [108]:
series6

0     10
1     20
2     30
3     40
4     55
5     60
6    100
7     80
8     90
9    100
dtype: int64

In [109]:
for i in series6:
    if i==100:
        print('Yes the element 100 is present')

Yes the element 100 is present
Yes the element 100 is present

In [112]:
def isPresent(ds,elem):
    present=False
    for k in ds:
        if k==elem:
            present=True
            break
    return present

In [113]:
isPresent([1,23,45,67,88,99,100,23,56,78,100],100)

True

6. For the given series A and B, perform concatenation on the same.

series_A = pd.Series([1,2,3,4,5])

series_B = pd.Series([6,7,8,9,10])

In [114]:
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])

In [123]:
series_A_B=pd.concat((series_A,series_B),ignore_index=True)
series_A_B

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [122]:
series_A_B[0]

0    1
0    6
dtype: int64


7. Using loops in python, print all the elements within a pandas series.

Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [128]:
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])
Sample

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [127]:
for i in Sample:
    print(i)

1
2
3
4
5
6
7
8
9
10

8. For a given nested list and a sample dictionary, create two data frames using pandas.

List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]

Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [137]:
List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]
Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [138]:
List

[['AA', 'BB', 'CC'], ['DD', 'EE', 'FF'], ['GG', 'HH', 'II']]

In [131]:
Dictionary

{'Kris': ['Jordan', 12, 22], 'Memphis': ['Depay', 23, 24]}

In [139]:
df1=pd.DataFrame(List)
df1

    0   1   2
0  AA  BB  CC
1  DD  EE  FF
2  GG  HH  II

In [143]:
Dictionary

{'Kris': ['Jordan', 12, 22], 'Memphis': ['Depay', 23, 24]}

In [142]:
df2=pd.DataFrame(Dictionary)
df2

     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

In [141]:
List1 = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II','JJ']]
df3=pd.DataFrame(List1)
df3

    0   1   2     3
0  AA  BB  CC  None
1  DD  EE  FF  None
2  GG  HH  II    JJ

In [144]:
Dictionary1 = { 'Kris': {'Jordan':12},'Memphis': {'Depay':23}}

In [145]:
df4=pd.DataFrame(Dictionary1)
df4

        Kris  Memphis
Jordan  12.0      NaN
Depay    NaN     23.0

9. Create a pandas Dataframe with two columns = [‘Name’, ‘Age’]. Perform the following
operations on the same.

a. Print the first 3 rows of the Data Frame .

b. Print the rows that have the age greater than 15.

c. Insert 5 imaginary names and ages as values to the pandas Data Frame .

d. Update the 5th row so that the name = john and age=56.

e. Delete the first row from the Data Frame .

In [146]:
dict_1={'Name':['Akash','Aarav','Arjun','Shiv','Akshay'],'Age':[27,25,28,25,26]}
data=pd.DataFrame(dict_1)

In [147]:
data

     Name  Age
0   Akash   27
1   Aarav   25
2   Arjun   28
3    Shiv   25
4  Akshay   26

In [149]:
data.head(3)

    Name  Age
0  Akash   27
1  Aarav   25
2  Arjun   28

In [150]:
data[0:3]

    Name  Age
0  Akash   27
1  Aarav   25
2  Arjun   28

In [151]:
data.iloc[0:3]

    Name  Age
0  Akash   27
1  Aarav   25
2  Arjun   28

In [152]:
data[data['Age']>15]

     Name  Age
0   Akash   27
1   Aarav   25
2   Arjun   28
3    Shiv   25
4  Akshay   26

In [153]:
data[data.Age>15]

     Name  Age
0   Akash   27
1   Aarav   25
2   Arjun   28
3    Shiv   25
4  Akshay   26

In [157]:
data.insert(column={'Name','Age'},value={['Ankit','Abhi','Arnav','Shreya','Hitesh'],[22,24,18,23,21]})

TypeError: unhashable type: 'list'

In [158]:
dict_2={'Name':['Vipul','Pearl','Sajal','Shreya','Sushma'],'Age':[25,22,32,24,26]}
data1=pd.DataFrame(dict_2)
data1

     Name  Age
0   Vipul   25
1   Pearl   22
2   Sajal   32
3  Shreya   24
4  Sushma   26

In [162]:
data_2=pd.concat((data,data1),ignore_index=True)

In [164]:
data.loc[len(data.index)] = ['Atul', 89]
data

     Name  Age
0   Akash   27
1   Aarav   25
2   Arjun   28
3    Shiv   25
4  Akshay   26
5    Atul   89
6    Atul   89

In [167]:
data.loc[4]=['John',56]

In [165]:
data.loc[4,'Name']='John'
data.loc[4,'Age']=56

In [166]:
data

    Name  Age
0  Akash   27
1  Aarav   25
2  Arjun   28
3   Shiv   25
4   John   56
5   Atul   89
6   Atul   89

In [168]:
data.drop(0)

    Name  Age
1  Aarav   25
2  Arjun   28
3   Shiv   25
4   John   56
5   Atul   89
6   Atul   89

10. For the Data Frame obtained from step 9, convert the same to a list and a dictionary
respectively.

In [169]:
data

    Name  Age
0  Akash   27
1  Aarav   25
2  Arjun   28
3   Shiv   25
4   John   56
5   Atul   89
6   Atul   89

In [172]:
l_1=list(data.values)
l_1

[array(['Akash', 27], dtype=object),
 array(['Aarav', 25], dtype=object),
 array(['Arjun', 28], dtype=object),
 array(['Shiv', 25], dtype=object),
 array(['John', 56], dtype=object),
 array(['Atul', 89], dtype=object),
 array(['Atul', 89], dtype=object)]

In [174]:
data.values.tolist()

[['Akash', 27],
 ['Aarav', 25],
 ['Arjun', 28],
 ['Shiv', 25],
 ['John', 56],
 ['Atul', 89],
 ['Atul', 89]]

In [173]:
d_1=dict(data.values)
d_1

{'Akash': 27, 'Aarav': 25, 'Arjun': 28, 'Shiv': 25, 'John': 56, 'Atul': 89}

11. Create two separate Data Frame s A and B, and perform the following operations on
 them.

a. Concatenate the two Data Frame s to a new Data Frame C.

b. Split the Data Frame C row wise.

c. Split the Data Frame column wise based on a condition. For example - columns
values greater than 10, column values less than 10, etc.

In [175]:
A=pd.DataFrame([1,2,3,4,5])
B=pd.DataFrame([11,12,13,14,15])

In [176]:
C=pd.concat([A,B],ignore_index=True)
C

    0
0   1
1   2
2   3
3   4
4   5
5  11
6  12
7  13
8  14
9  15

In [178]:
df_3=C.iloc[:4]
df_3

   0
0  1
1  2
2  3
3  4

In [179]:
df_3=C.iloc[4:]
df_3

    0
4   5
5  11
6  12
7  13
8  14
9  15

In [180]:
import numpy as np

In [182]:
np.vsplit(C,2)

[   0
 0  1
 1  2
 2  3
 3  4
 4  5,
     0
 5  11
 6  12
 7  13
 8  14
 9  15]

In [ ]:
# Homework->Task c. Columnwisesplit

12. Create a Data Frame with columns Name and Age. Perform the following operations.

a. Write a sample code to search for the Name/Names where Age is 20.

b. Sort the Data Frame in ascending order of ages.

c. Using Python loops, print the ages from the data frame and store it in a set.

In [184]:
data1=pd.DataFrame.from_dict({'Name':['Vipul','Pearl','Sajal','Shreya','Sushma','Matt','Jenny','Jenny','Matt','Kristen'],
                              'Age':[25,22,32,24,26,20,22,22,20,27]})
data1

      Name  Age
0    Vipul   25
1    Pearl   22
2    Sajal   32
3   Shreya   24
4   Sushma   26
5     Matt   20
6    Jenny   22
7    Jenny   22
8     Matt   20
9  Kristen   27

In [185]:
data1[data1.Age==20]

   Name  Age
5  Matt   20
8  Matt   20

In [186]:
data1.sort_values(by='Age')

      Name  Age
5     Matt   20
8     Matt   20
1    Pearl   22
6    Jenny   22
7    Jenny   22
3   Shreya   24
0    Vipul   25
4   Sushma   26
9  Kristen   27
2    Sajal   32

In [188]:
l=[]
for i in range(len(data1)):
    l.append(data1.loc[i,'Age'])
print(l)
set1=set(l)
set1

[25, 22, 32, 24, 26, 20, 22, 22, 20, 27]

{20, 22, 24, 25, 26, 27, 32}

In [190]:
set1 = set()
for i in data1['Age']:
    set1.add(i)
set1

{20, 22, 24, 25, 26, 27, 32}